In [1]:
"https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv"

'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv'

## Basic DataFrame

Consider the following Python dictionary data and Python list labels:

```
data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills', 'Cranes'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4, 3.5], 'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2, 2],
        'priority': ['yes', 'yes', 'no', np.nan, 'no', 'no', 'no', 'yes', 'no', 'no','yes']}
```
```
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k']
```

###`Q-1:`
i. Create a DataFrame birds from the above dictionary data which has the index labels.

ii. Display basic information about the dataFrame.

iii. Show Alternate rows of the dataframe.

In [2]:
# code here
import pandas as pd
import numpy as np
data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills', 'Cranes'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4, 3.5], 'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2, 2],
        'priority': ['yes', 'yes', 'no', np.nan, 'no', 'no', 'no', 'yes', 'no', 'no','yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k']


df = pd.DataFrame(data,index=labels)

#i. Create a DataFrame birds from the above dictionary data which has the index labels.
#ii. Display basic information about the dataFrame.
print(df.head(2))
#iii. Show Alternate rows of the dataframe.
print(df[::2])

    birds  age  visits priority
a  Cranes  3.5       2      yes
b  Cranes  4.0       4      yes
        birds  age  visits priority
a      Cranes  3.5       2      yes
c     plovers  1.5       3       no
e  spoonbills  6.0       3       no
g     plovers  5.5       2       no
i  spoonbills  8.0       3       no
k      Cranes  3.5       2      yes

###`Q-2:`
i. Show only rows [1st, 3rd, 7th] from columns ['bird', 'age']

ii. Select rows where the number of visits is less than 4.

In [3]:
# code here
#i. Show only rows [1st, 3rd, 7th] from columns ['bird', 'age']
rows = [1, 3, 7]
columns = ['birds', 'age']
print(df.iloc[rows][columns])
print("\n")

#ii. Select rows where the number of visits is less than 4.
print(df[df['visits']<4])
print("\n")

        birds  age
b      Cranes  4.0
d  spoonbills  NaN
h      Cranes  NaN


        birds  age  visits priority
a      Cranes  3.5       2      yes
c     plovers  1.5       3       no
e  spoonbills  6.0       3       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no
k      Cranes  3.5       2      yes

###`Q-3:`
i. Select all rows with nan values in age and visits column.

ii. Fill nan with respective series mode value.

In [4]:
# code here
#i. Select all rows with nan values in age and visits column.
df[df['age'].isna()]
#ii. Fill nan with respective series mode value.
df['age_handler']=df['age'].mode()
df

        birds  age  visits priority  age_handler
a      Cranes  3.5       2      yes          NaN
b      Cranes  4.0       4      yes          NaN
c     plovers  1.5       3       no          NaN
d  spoonbills  NaN       4      NaN          NaN
e  spoonbills  6.0       3       no          NaN
f      Cranes  3.0       4       no          NaN
g     plovers  5.5       2       no          NaN
h      Cranes  NaN       2      yes          NaN
i  spoonbills  8.0       3       no          NaN
j  spoonbills  4.0       2       no          NaN
k      Cranes  3.5       2      yes          NaN

###`Q-4`
i. Find the total number of visits of the bird Cranes

ii. Find the number of each type of birds in dataframe.

iii. Print no of duplicate rows

iv. Drop Duplicates rows and make this changes permanent. Show dataframe after changes.

In [5]:
# code here
print("i. Find the total number of visits of the bird Cranes")
print(df[df['birds']=='Cranes'][['birds','visits']])

print("total number of visists\n",df[df['birds']=='Cranes']['visits'].sum())

print("\n ii. Find the number of each type of birds in dataframe.")
print("\n",df['birds'].value_counts())

print("\n iii. Print no of duplicate rows")
print("\n",df[df.duplicated()])
print("\nTotal Duplicates",df[df.duplicated()].count())

print("\n iv. Drop Duplicates rows and make this changes permanent. Show dataframe after changes.")
df.drop_duplicates(inplace=True)
print("\nTotal Duplicates",df[df.duplicated()].count())
df

i. Find the total number of visits of the bird Cranes
    birds  visits
a  Cranes       2
b  Cranes       4
f  Cranes       4
h  Cranes       2
k  Cranes       2
total number of visists
 14

 ii. Find the number of each type of birds in dataframe.

 birds
Cranes        5
spoonbills    4
plovers       2
Name: count, dtype: int64

 iii. Print no of duplicate rows

     birds  age  visits priority  age_handler
k  Cranes  3.5       2      yes          NaN

Total Duplicates birds          1
age            1
visits         1
priority       1
age_handler    0
dtype: int64

 iv. Drop Duplicates rows and make this changes permanent. Show dataframe after changes.

Total Duplicates birds          0
age            0
visits         0
priority       0
age_handler    0
dtype: int64

        birds  age  visits priority  age_handler
a      Cranes  3.5       2      yes          NaN
b      Cranes  4.0       4      yes          NaN
c     plovers  1.5       3       no          NaN
d  spoonbills  NaN       4      NaN          NaN
e  spoonbills  6.0       3       no          NaN
f      Cranes  3.0       4       no          NaN
g     plovers  5.5       2       no          NaN
h      Cranes  NaN       2      yes          NaN
i  spoonbills  8.0       3       no          NaN
j  spoonbills  4.0       2       no          NaN

##Question on IPL Data

IPL Data Link :  https://drive.google.com/file/d/1yKVUuexl6lIKuFQy7uIPgDgXhJ0L4SIg/view?usp=share_link

https://www.kaggle.com/datasets/vora1011/ipl-2008-to-2021-all-match-dataset?select=IPL_Matches_2008_2022.csv

Download ipl matches 2008-2022 file.

###`Q-5:` In IPL matches dataset some teams name has changed.
You will have to consider them as same.
```
'Delhi Capitals' formerly as 'Delhi Daredevils'
'Punjab Kings' formerly as 'Kings XI Punjab'
'Rising Pune Supergiant' formerly as 'Rising Pune Supergiants'
```
You need to make changes accordingly. Consider current name for each teams.

Be careful Gujrat Titans and Gujrat Lions are different teams.

In [6]:
# code here
def change_team(value):
    if value == 'Delhi Daredevils':
        return 'Delhi Capitals'
    elif value == 'Kings XI Punjab':
        return 'Punjab Kings'
    elif value == 'Rising Pune Supergiants':
        return 'Rising Pune Supergiant'
    else:
        return value
        
df1 =  pd.read_csv("D:\\PROJECT_PRACTISE_DIRS\\DSML_PRACTISE_FILES\\DATASETS\\IPL_Matches_2008_2022.csv")
df2 =  pd.read_csv("D:\\PROJECT_PRACTISE_DIRS\\DSML_PRACTISE_FILES\\DATASETS\\IPL_Matches_2008_2022.csv")


df1['Team1'] = df1['Team1'].apply((change_team))
df1['Team2'] = df1['Team2'].apply((change_team))
df1['TossWinner'] = df1['TossWinner'].apply((change_team))
df1['WinningTeam'] = df1['WinningTeam'].apply((change_team))

df1.head()

total_count1 = df1[df1['Team1'] == 'Kings XI Punjab'].count()['Team1']
print(total_count1)

total_count2 = df2[df2['Team1'] == 'Kings XI Punjab'].count()['Team1']
print(total_count2)

#Method 2 using replace

df2.replace("Kings XI Punjab","Punjab Kings",inplace=True)
df2.replace("Delhi Daredevils","Delhi Capitals",inplace=True)
df2.replace("Rising Pune Supergiants","Rising Pune Supergiant",inplace=True)


total_count3 = df2[df2['Team1'] == 'Kings XI Punjab'].count()['Team1']
print(total_count3)

0
92
0

###`Q-6` Write a code which can display the bar chart of top 5 teams who have played maximum number of matches in the IPL.
>  Hint: Be careful the data is divided in 2 different cols(Team 1 and Team 2)

In [7]:
# code here
total_matches = df1['Team1'].value_counts() + df1['Team2'].value_counts()
total_matches.sort_values(ascending=False)

Mumbai Indians                 231
Royal Challengers Bangalore    226
Delhi Capitals                 224
Kolkata Knight Riders          223
Punjab Kings                   218
Chennai Super Kings            208
Rajasthan Royals               192
Sunrisers Hyderabad            152
Deccan Chargers                 75
Pune Warriors                   46
Gujarat Lions                   30
Rising Pune Supergiant          30
Gujarat Titans                  16
Lucknow Super Giants            15
Kochi Tuskers Kerala            14
Name: count, dtype: int64

###`Q-7:` Player who got Most no. of player of the match award playing against Mumbai Indians.
> Just for this question assume player of the match award is given to players from winning team. Although this is true in most of the cases.

In [8]:
# code here
mom = df1[((df1['Team1']=='Mumbai Indians') | (df1['Team2']=='Mumbai Indians')) & (df1['WinningTeam']=='Mumbai Indians')]['Player_of_Match'].value_counts().sort_values(ascending=False)
print(mom.index[0],mom[0])

RG Sharma 15

C:\Users\Adari Shanmukh\AppData\Local\Temp\ipykernel_20036\3128018944.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(mom.index[0],mom[0])

###`Q-8:` Team1 vs Team2 Dashbord
Create a function which will take two string(name of two teams) as input. Show win Loss record between them and player getting most player of the match award in matches between these two teams.
```
team1_vs_team2('Kolkata Knight Riders','Chennai Super Kings')
```

In [80]:
# code here
df1.head()
team1='Royal Challengers Bangalore'
team2= 'Chennai Super Kings'
def team1_vs_team2(team1,team2):
    df3 = df1[(df1['Team1'].isin([team1,team2]) & df1['Team2'].isin([team1,team2]))]
    winpercentage=(df3[df3['WinningTeam'] == team1].shape[0] / df3.shape[0] )* 100
    losspercentage = 100 - winpercentage
    mom =  df3['Player_of_Match'].value_counts().sort_values(ascending=False).index[0]
    mom_count =  df3['Player_of_Match'].value_counts().sort_values(ascending=False)[0]
    
    winpercentage = {team1:winpercentage}
    losspercentage = {team2:losspercentage}
    mom = {"MOM":mom,'mom_count':mom_count}
    return winpercentage,losspercentage,mom
     
result = team1_vs_team2(team1,team2)
print(result)

({'Royal Challengers Bangalore': 34.48275862068966}, {'Chennai Super Kings': 65.51724137931035}, {'MOM': 'SK Raina', 'mom_count': 3})

C:\Users\Adari Shanmukh\AppData\Local\Temp\ipykernel_20036\190876174.py:10: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  mom_count =  df3['Player_of_Match'].value_counts().sort_values(ascending=False)[0]

### `Q-9:` Find out the top 7 cities where the matches of Kolkata Knight Riders are played frequently and plot the result as bar chart.

*`.plot(kind = "bar")` can help you to plot the bar chart. Also you can learn more about this method from [here](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.plot.html)*

In [95]:
# code here

df4 = df1[(df1['Team1'] == 'Kolkata Knight Riders') | (df1['Team2'] == 'Kolkata Knight Riders')]
frequent_venue = df4['City'].value_counts().sort_values(ascending=False).index[0]
print(frequent_venue)
df1.head()

Kolkata

,ID,City,Date,Season,MatchNumber,Team1,Team2,Venue,TossWinner,TossDecision,SuperOver,WinningTeam,WonBy,Margin,method,Player_of_Match,Team1Players,Team2Players,Umpire1,Umpire2
0,1312200,Ahmedabad,2022-05-29,2022,Final,Rajasthan Royals,Gujarat Titans,"Narendra Modi Stadium, Ahmedabad",Rajasthan Royals,bat,N,Gujarat Titans,Wickets,7.0,NaN,HH Pandya,"['YBK Jaiswal', 'JC Buttler', 'SV Samson', 'D ...","['WP Saha', 'Shubman Gill', 'MS Wade', 'HH Pan...",CB Gaffaney,Nitin Menon
1,1312199,Ahmedabad,2022-05-27,2022,Qualifier 2,Royal Challengers Bangalore,Rajasthan Royals,"Narendra Modi Stadium, Ahmedabad",Rajasthan Royals,field,N,Rajasthan Royals,Wickets,7.0,NaN,JC Buttler,"['V Kohli', 'F du Plessis', 'RM Patidar', 'GJ ...","['YBK Jaiswal', 'JC Buttler', 'SV Samson', 'D ...",CB Gaffaney,Nitin Menon
2,1312198,Kolkata,2022-05-25,2022,Eliminator,Royal Challengers Bangalore,Lucknow Super Giants,"Eden Gardens, Kolkata",Lucknow Super Giants,field,N,Royal Challengers Bangalore,Runs,14.0,NaN,RM Patidar,"['V Kohli', 'F du Plessis', 'RM Patidar', 'GJ ...","['Q de Kock', 'KL Rahul', 'M Vohra', 'DJ Hooda...",J Madanagopal,MA Gough
3,1312197,Kolkata,2022-05-24,2022,Qualifier 1,Rajasthan Royals,Gujarat Titans,"Eden Gardens, Kolkata",Gujarat Titans,field,N,Gujarat Titans,Wickets,7.0,NaN,DA Miller,"['YBK Jaiswal', 'JC Buttler', 'SV Samson', 'D ...","['WP Saha', 'Shubman Gill', 'MS Wade', 'HH Pan...",BNJ Oxenford,VK Sharma
4,1304116,Mumbai,2022-05-22,2022,70,Sunrisers Hyderabad,Punjab Kings,"Wankhede Stadium, Mumbai",Sunrisers Hyderabad,bat,N,Punjab Kings,Wickets,5.0,NaN,Harpreet Brar,"['PK Garg', 'Abhishek Sharma', 'RA Tripathi', ...","['JM Bairstow', 'S Dhawan', 'M Shahrukh Khan',...",AK Chaudhary,NA Patwardhan

### `Q-10:` Find out the average margin for the team Mumbai Indians for only the session 2011.

In [106]:
# code here
df5=df1[((df1['Team1']=="Mumbai Indians") | (df1['Team2']=='Mumbai Indians')) & (df1['Season']=='2011')]
df5.describe()

                  ID     Margin
count      16.000000  16.000000
mean   501238.125000  19.250000
std        23.371992  19.443937
min    501201.000000   4.000000
25%    501220.250000   7.750000
50%    501239.000000   9.500000
75%    501257.750000  25.250000
max    501270.000000  76.000000